In [261]:
import pandas as pd

In [262]:
df1=pd.read_excel('Customer Demographic_cleaned.xlsx')

In [263]:
df2=pd.read_excel('NewCustomerList.xlsx')

In [264]:
df3=pd.read_excel('Transaction_dataset_cleaned.xlsx')

In [265]:
df4=pd.read_excel('CustomerAddress_cleaned.xlsx')

In [266]:
df1.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,year
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,1953.0
1,2,Eli,Bockman,M,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,1980.0
2,3,Arlin,Dearle,M,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,1954.0
3,4,Talbot,NaN,M,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,1961.0
4,5,Sheila-kathryn,Calton,F,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,1977.0

In [267]:
df2.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation
0,Chickie,Brister,M,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6
1,Morly,Genery,M,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11
2,Ardelis,Forrester,F,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5
3,Lucine,Stutt,F,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1
4,Melinda,Hadlee,F,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9

In [268]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 16 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               983 non-null    object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
dtypes: datetime64[ns](1), int64(4), object(11)
memory usage: 125.1+ KB

In [269]:
df2['past_3_years_bike_related_purchases']=df2['past_3_years_bike_related_purchases'].astype('float')
df2['tenure']=df2['tenure'].astype('float')
df2['property_valuation']=df2['property_valuation'].astype('float')

In [270]:
df2['year']=df2['DOB'].dt.year# year attribute is used to calculate age later

In [271]:
df4.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,NSW,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [272]:
df1.shape

(3999, 13)

In [273]:
df4.shape

(3999, 6)

In [274]:
df5=pd.merge(df1,df4,on='customer_id')

In [275]:
df1.shape

(3999, 13)

In [276]:
df5.shape

(3995, 18)

In [277]:
df5=df5.append(df2)

In [278]:
df5.shape

(4995, 18)

In [279]:
df5=pd.merge(df5,df3,on='customer_id')

In [280]:
df5.shape

(19959, 30)

In [281]:
df5.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,...,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_price
0,1.0,Laraine,Medendorp,F,93.0,1953-10-12,Executive Secretary,Health,Mass Customer,N,...,2017-12-23,0.0,Approved,OHM Cycles,Standard,medium,medium,235.63,125.07,38482.0
1,1.0,Laraine,Medendorp,F,93.0,1953-10-12,Executive Secretary,Health,Mass Customer,N,...,2017-04-06,1.0,Approved,Solex,Standard,medium,medium,1577.53,826.51,39526.0
2,1.0,Laraine,Medendorp,F,93.0,1953-10-12,Executive Secretary,Health,Mass Customer,N,...,2017-05-11,1.0,Approved,Trek Bicycles,Road,low,small,1720.70,1531.42,37823.0
3,1.0,Laraine,Medendorp,F,93.0,1953-10-12,Executive Secretary,Health,Mass Customer,N,...,2017-01-05,0.0,Approved,Norco Bicycles,Standard,medium,medium,360.40,270.30,37873.0
4,1.0,Laraine,Medendorp,F,93.0,1953-10-12,Executive Secretary,Health,Mass Customer,N,...,2017-02-21,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,38573.0

In [282]:
df5.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'year', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'transaction_id', 'product_id',
       'transaction_date', 'online_order', 'order_status', 'brand',
       'product_line', 'product_class', 'product_size', 'list_price',
       'standard_cost', 'product_first_sold_price'],
      dtype='object')

In [283]:
df3.shape

(20000, 13)

In [284]:
df2.shape

(1000, 17)

In [285]:
df5.isnull().sum()

customer_id                               0
first_name                                0
last_name                               642
gender                                  446
past_3_years_bike_related_purchases       0
DOB                                     446
job_title                              2379
job_industry_category                  3222
wealth_segment                            0
deceased_indicator                        0
owns_car                                  0
tenure                                  446
year                                    446
address                                   0
postcode                                  0
state                                     0
country                                   0
property_valuation                        0
transaction_id                            0
product_id                                0
transaction_date                          0
online_order                            359
order_status                              0
brand                                   194
product_line                            194
product_class                           194
product_size                            194
list_price                                0
standard_cost                           194
product_first_sold_price                194
dtype: int64

In [286]:
df5.duplicated().sum()

0

In [287]:
df5['tenure'].fillna(df5['tenure'].mean(),inplace=True)

In [288]:
df5['standard_cost'].fillna(df5['standard_cost'].mean(),inplace=True)

In [289]:
df5['product_first_sold_price'].fillna(df5['product_first_sold_price'].mean(),inplace=True)

In [292]:
df5['online_order'].fillna(df5['online_order'].value_counts().idxmax(),inplace=True)

In [294]:
df5['brand'].fillna(df5['brand'].value_counts().idxmax(),inplace=True)

In [295]:
df5['product_line'].fillna(df5['product_line'].value_counts().idxmax(),inplace=True)

In [297]:
df5['product_class'].fillna(df5['product_class'].value_counts().idxmax(),inplace=True)

In [304]:
df5['last_name'].fillna('Missing Value',inplace=True)
df5['gender'].fillna(df5['gender'].value_counts().idxmax(),inplace=True)

In [298]:
df5['product_size'].fillna(df5['product_size'].value_counts().idxmax(),inplace=True)

In [299]:
df5['job_industry_category'].fillna(df5['job_industry_category'].value_counts().idxmax(),inplace=True)
df5['job_title'].fillna(df5['job_title'].value_counts().idxmax(),inplace=True)

In [300]:
df5['DOB'].fillna('00-00-00',inplace=True)

In [301]:
df5['year'].fillna(df5['year'].mean(),inplace=True)

In [302]:
df5['Age']=2017-df5['year']

In [305]:
df5.isnull().sum()

customer_id                            0
first_name                             0
last_name                              0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_title                              0
job_industry_category                  0
wealth_segment                         0
deceased_indicator                     0
owns_car                               0
tenure                                 0
year                                   0
address                                0
postcode                               0
state                                  0
country                                0
property_valuation                     0
transaction_id                         0
product_id                             0
transaction_date                       0
online_order                           0
order_status                           0
brand                                  0
product_line                           0
product_class                          0
product_size                           0
list_price                             0
standard_cost                          0
product_first_sold_price               0
Age                                    0
dtype: int64

In [306]:
df5.shape

(19959, 31)

In [307]:
df5.describe(include='object')

,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,state,country,order_status,brand,product_line,product_class,product_size
count,19959,19959,19959,19959,19959,19959,19959,19959,19959,19959,19959,19959,19959,19959,19959,19959,19959
unique,2834,3263,2,3047,195,9,3,2,2,3486,3,1,2,6,4,3,3
top,Corabelle,Missing Value,F,00-00-00,Social Worker,Manufacturing,Mass Customer,N,Yes,3 Mariners Cove Terrace,NSW,Australia,Approved,Solex,Standard,medium,medium
freq,36,642,10443,446,2605,7236,10029,19951,10042,14,10685,19959,19781,4439,14345,13991,13159

In [308]:
#to fill categorical variavles with mode value df['col'].valu_counts().idxmax()

In [312]:
df5.to_excel('KPMG.xlsx',index=False)